In [3]:
import pandas as pd
import numpy as np
import math
import random

In [4]:
# Extracting data from three different .csv sources

# Here we read employees.csv file and store in emp as a dataframe
emp = pd.read_csv('/home/sage_gaurab/chained/code_world/ds_py/data_src/employees.csv')

# Here we read departments.csv file and store in dept as a dataframe
dept = pd.read_csv('/home/sage_gaurab/chained/code_world/ds_py/data_src/departments.csv')

# Here we read bonus.csv file and store in bonus as a dataframe
bonus = pd.read_csv('/home/sage_gaurab/chained/code_world/ds_py/data_src/bonus.csv')

In [ ]:
# Funciton for producing full_name column
def add_full_name(df):
    return df.assign(full_name = df['first_name'] + ' ' + df['last_name'])

# Funciton to replace null salary value
def replace_null_salary(df, method = 'mean'):
    if method == 'mean':
        fill_value = df['salary'].mean().round(0)
    elif method == 'dept_mean':
        fill_value = df.groupby('department_id')['salary'].transform('mean').round(0)
    elif method == 'median':
        fill_value = df['salary'].median().round(0)
    return df.assign(salary = df['salary'].fillna(fill_value))

# Function to join all three table
def joined_df(df, df_dept, df_bonus):
    return(
        df.merge(df_dept, on = 'department_id', how = 'left').
           merge(df_bonus, on = 'employee_id',  how = 'left')
    )
# Function to fill null bonus rows                                                                  
def replace_null_bonus(df):
    return df.assign(bonus_amount = df['bonus_amount'].fillna(0))
    
# Function to calculate annual salary
def add_annual_salary(df):
    return df.assign(annual_salary = df['salary']*12) # 1st chal

# Function to calculate perfomance bonus
def add_performance_bonus(df):
    return df.assign(performance_bonus = (df['bonus_amount'] * df['performance_score']/100).round(0))
    

# _________________________________________ Analysing function _________________________________________________________

def average_salary(df):
    return df.assign(average_salary = df['salary'].mean())

def total_salary(df):
    return df.assign(total_salary = df['salary'].sum())

In [5]:
emp.head(1)

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score
0,1,John,Doe,10,60000.0,2020-01-15,New York,85

In [6]:
emp.sample()

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score
16,17,Matthew,Martinez,10,64000.0,2021-07-20,Las Vegas,81

In [7]:
dept.sample()

   department_id department_name     location  budget
1             20       Marketing  Los Angeles  800000

In [8]:
bonus.sample()

   employee_id  bonus_amount  bonus_date
1            2          8000  2023-01-01

In [9]:
# Functions
# full_name 

def full_name(df):
    df['full_name'] = df['first_name'] + ' ' + df['last_name']


# def fill_null_salary(df):
#  return df.assign(lambda x : )

def merge_three_tables(df_emp, df_bonus, df_dept):
    df_emp.merge(dept, on = 'department_id', how = 'left')

In [19]:
merged_data = emp.merge(dept, on = 'department_id', how = 'left').merge(bonus, on = 'employee_id', how = 'left')
merged_data

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,department_name,location,budget,bonus_amount,bonus_date
0,1,John,Doe,10,60000.0,2020-01-15,New York,85,Sales,New York,500000,5000,2023-01-01
1,2,Jane,Smith,20,75000.0,2020-02-20,Los Angeles,92,Marketing,Los Angeles,800000,8000,2023-01-01
2,4,Emily,Brown,30,80000.0,2020-04-05,Houston,95,IT,Chicago,1200000,10000,2023-01-01
3,6,Laura,Wilson,20,72000.0,2020-06-18,Philadelphia,90,Marketing,Los Angeles,800000,7000,2023-01-01
4,8,Sophia,Taylor,10,62000.0,2020-08-30,Dallas,91,Sales,New York,500000,6000,2023-01-01
5,11,William,Jackson,10,61000.0,2021-01-10,Seattle,83,Sales,New York,500000,5500,2023-01-01
6,13,Michael,Harris,20,74000.0,2021-03-20,Miami,87,Marketing,Los Angeles,800000,7500,2023-01-01
7,15,Daniel,Thompson,40,56000.0,2021-05-30,Boston,75,HR,Houston,400000,4000,2023-01-01
8,18,Charlotte,Robinson,20,76000.0,2021-08-25,Orlando,94,Marketing,Los Angeles,800000,9000,2023-01-01

In [25]:
(emp.groupby(['department_id'])
    .agg(
        total_salary = ('salary', 'mean')
    )
)

               total_salary
department_id
10             62142.857143
20             75000.000000
30             82500.000000
40             57000.000000